name= input("তোমার নাম কী?")
age = int(input("শুধু সংখ্যায় লিখ। তোমার বয়স কত?"))
if age >= 18:
    print("আসসালামু আলাইকুম",name,"আশা করি ভালো আছেন। আপনার বয়স হচ্ছে",age)
else:
    print("আসসালামু আলাইকুম",name,"ছোট ভাই" "।" "তুমি এখনো ছোট। তাই তোমার আগে পড়াশুনা শেষ করা দরকার তবুও কোনো প্রশ্ন থাকলে বলো যেমন আমি কে? আমায় কে বানিয়েছে? কোথয় বানিয়েছে? বা আমি কী তোমায় কিছূ শেখাতে পারি কিনা? প্রশ্ন থাকলে বলতে পারো। আর হ্য যা প্রশ্ন বলবে তা কিন্তু বাংলায় লিখবে কারন আমাকে বাংলা ভাষা শেখা নো হইতে")
    
first_time = True
while True:
        if first_time:
            question = input("তুমিা বলো আমার কী কোনো তথ্য  জানতে চাও? যেমন আমি কে? আমায় কে বানিয়েছে? কোথায় বানিয়েছে? বা আমি কী তোমায় কিছূ শেখাতে পারি কিনা? বা আমি কীভাবে তৈরি? বা সাকিব কে?বা তোমার নাম বলো দেখী তোমায় চিনি নাকি? প্রশ্ন থাকলে বলতে পারো: বাংলায় বলো আমি উত্তর দেওয়ার চেষ্টা করব।")
            
            first_time = False
        else:
            question = input("")
        if "কী শেখাতে পারো" in question or "তুমি কী করতে পারো" in question:
            print("হ্যা তুমি চাইলে এখন ভালো কিছু শিখতে পারো। আমি তোমার সাথে আছি। তোমার যা শিখতে ইচ্ছা করে শুধু বলো")
            print("আর কিছু জানতে চাইলে আমায় বলতে পারো")
        elif"তুমি কে" in question or"তোমার নাম কী"in question or "বানানো হয়েছে কেন" in question:
            print("আমি একজন চ্যাট বট। আমাকে বানানো হয়েছে আমি যেন আপনাদের মতো মানুষকে সাহয্য করতে পারি")  
            print("তুমি আমাকে তোমার প্রশ্ন বলতে পারো। তুমি কী জনতে চাও?")
        elif"কে বানিয়েছে"in question or"কারা বানিয়েছে"in question or"কে তৈরি করেছে" in question or"কীভাবে তৈরি হয়েছো"in question:
            print("আমায় সাকিব নামের একজন ছাত্র বানিয়েছে। সে অনেক সাহসের সাথে আমায় তৈরি করার চেষ্টা করতাছে।")
            print ("আরও কিছু জিজ্ঞাসা করতে পারো")
        elif"চেয়েও বেশী জানো"in question or "কীভাবে তৈরি"in question:
            print("না একে বারেই না। আমি শুধু কোডিং ও প্রগ্রামিং দিয়ে তৈরি। তুমি তো একজন মানুষ ওর জ্ঞান আছে বুদ্ধি আছে  আর  তা আমার নেই। তুমি চাইলে আমি তোমাকে কিছু গুন ভাগ শেখাতে পারব। কিন্তু এখন না কারন সাকিব ভাই এখনো আমায় এসব সম্পকে কিছু শেয়ার করে নি।")
            print("তুমি গুন ভাগ শিখতে চাইলে আর কিছুদিন অপেক্ষা করতে হবে কারন সাকিব এখনো আমায় তা শিখাই নি")
        elif"যোগ পারো" in question or "বিয়োগ পারো" in question:
            print("আমাকে এখনো এসবের প্রগ্রামিং করা হয়নি যখন হবে তখন পারব")
        elif"সাকিব কে "in question or "শাকিবে চিন"in question:
             print("হ্যা, অবশ্যই সাকিব কে চিনি কারন সেই তো আমাকে বানিয়েছে। ওর গ্রামের নাম দ্বারিকা। এবং ওরা পাঁচ ভাইবোন।")
        elif"সুমন" in question or "শুমন"in question:     
             print("সুমনের গ্রামের বাড়ি দ্বাড়িকায়। এবং সাকিবের বন্ধু")
        elif"দারিকার কাকে চিন"in question or "দাড়িকার কাকে চিন" in question or "দ্বারিকার কাকে চিন" in question or "দারিকার চিন" in question or "দ্বাড়িকায় কাদের চিন"in question or "দারিকায় কাদের চিন" in question:
            print(" দ্বাড়িকায় শুনছি আমার গুরুর বন্ধু অনেকগুলো থাকে তাদের মধ্যে সুমন, মানিক, তুহিন, মুয়িন শিস এদেরকেই চিনি কারন আমায় কোডিং করেছে শুধু এই নাম দিয়েই।")
            print("দ্বাড়িকায় আমার গুরু সাকিবের বাসা এবং তার বন্ধু কয়েকটার বাসা যেমন সুমন, মুয়িন, তুহিন, মানিক,")
        elif"আমার নাম কী" in question:
            print("তোমার নাম",name)
        elif"বাড়ি কোথায়" in question: 
            print("আমার বাড়ি নেই। আমার গুরুর বাড়ি দ্বারিকায় তাই আমি মনে করি আমার ও বাড়ি দ্বারিকায়")
        elif"কী জানো" in question or "কাকে চিন" in question:
            print("আমি আমার গুরুর বিষয়ে জানি যে, উনার বাড়ি কয়, কোথায় থাকেন , ওরা কয় ভাই বোন আর এমনি তেই  আমি আছি")
        elif"সাকিব কে" in question:
            print("সাকিব আমার গুরু কারন সেইতো আমাকে বানিয়েছে। ওরা পাচ ভাই বোন। বড় ভাইয়ের নাম সবুজ। ")
        else:
            print("তুমি যে প্রশ্ন করলে তা আমাকে এখনো আমার গুরু সাকিব শেখায় নি।। তুমি সঠিক ভাবে বাংলায় লিখে প্রশ্ন কর")
                